reports/issue_134_raw_artifacts/raw_results/sharegpt-online/24/rep-2/bench.log
/root/vllm/vllm-hust/vllm/__init__.py:7: RuntimeWarning: Failed to read commit hash:
cannot import name '_version' from partially initialized module 'vllm' (most likely due to a circular import) (/root/vllm/vllm-hust/vllm/__init__.py)
  from .version import (  # isort:skip
INFO 08-05 10:42:12 [__init__.py:44] Available plugins for group vllm.platform_plugins:
INFO 08-05 10:42:12 [__init__.py:46] - ascend -> vllm_ascend:register
INFO 08-05 10:42:12 [__init__.py:58] Loading plugin ascend
INFO 08-05 10:42:12 [__init__.py:246] Platform plugin ascend is activated
INFO 08-05 10:42:12 [platform.py:60] Breakable cudagraph is force disabled on Ascend because DeepSeek V4 PIECEWISE cudagraph is not supported yet.
WARNING 08-05 10:42:50 [importing.py:78] Triton is installed, but `triton.backends` could not be imported. Disabling Triton.
INFO 08-05 10:42:50 [importing.py:93] Triton not installed or not compatible; certain GPU-related functions will not be available.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xfffcd84d7ec0>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='sharegpt', no_stream=False, dataset_path='/data/shared_datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=1024, random_output_len=128, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url=None, host='127.0.0.1', port=8421, endpoint='/v1/completions', header=None, max_concurrency=None, model='/data/shared_models/Qwen--Qwen2.5-14B-Instruct', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=1.0, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='/data/issue134-results/npu1.tmp/raw_results/sharegpt-online/24/rep-2', result_filename='raw.json', ignore_eos=False, self_timed=None, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-64d31c88-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 1.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None

  0%|          | 0/200 [00:00<?, ?it/s]
  0%|          | 1/200 [00:11<37:21, 11.26s/it]
  1%|          | 2/200 [00:23<38:35, 11.70s/it]
  2%|▏         | 4/200 [00:41<32:47, 10.04s/it]
  2%|▎         | 5/200 [00:45<27:06,  8.34s/it]
  3%|▎         | 6/200 [00:46<19:41,  6.09s/it]
  4%|▎         | 7/200 [00:48<14:59,  4.66s/it]
  4%|▍         | 8/200 [00:49<11:52,  3.71s/it]
  4%|▍         | 9/200 [00:53<11:40,  3.67s/it]
  5%|▌         | 10/200 [00:55<10:20,  3.26s/it]
  6%|▌         | 11/200 [00:59<10:44,  3.41s/it]
  6%|▌         | 12/200 [00:59<07:51,  2.51s/it]
  6%|▋         | 13/200 [01:01<06:57,  2.23s/it]
  7%|▋         | 14/200 [01:04<07:33,  2.44s/it]
  8%|▊         | 15/200 [01:06<06:45,  2.19s/it]
  9%|▉         | 18/200 [01:08<04:03,  1.34s/it]
 10%|▉         | 19/200 [01:08<03:26,  1.14s/it]
 10%|█         | 20/200 [01:10<03:55,  1.31s/it]
 11%|█         | 22/200 [01:14<05:00,  1.69s/it]
 12%|█▏        | 23/200 [01:16<04:39,  1.58s/it]
 12%|█▏        | 24/200 [01:18<05:36,  1.91s/it]
 13%|█▎        | 26/200 [01:19<03:32,  1.22s/it]
 14%|█▎        | 27/200 [01:19<02:59,  1.04s/it]
 14%|█▍        | 28/200 [01:22<03:57,  1.38s/it]
 14%|█▍        | 29/200 [01:23<03:37,  1.27s/it]
 15%|█▌        | 30/200 [01:24<03:25,  1.21s/it]
 16%|█▌        | 31/200 [01:27<04:59,  1.77s/it]
 16%|█▌        | 32/200 [01:32<07:10,  2.56s/it]
 16%|█▋        | 33/200 [01:34<06:48,  2.45s/it]
 17%|█▋        | 34/200 [01:36<06:50,  2.47s/it]
 18%|█▊        | 35/200 [01:38<06:32,  2.38s/it]
 18%|█▊        | 37/200 [01:40<04:23,  1.62s/it]
 19%|█▉        | 38/200 [01:41<03:59,  1.48s/it]
 20%|█▉        | 39/200 [01:42<03:36,  1.35s/it]
 20%|██        | 40/200 [01:45<04:58,  1.86s/it]
 20%|██        | 41/200 [01:46<04:20,  1.64s/it]
 21%|██        | 42/200 [01:47<03:22,  1.28s/it]
 22%|██▏       | 43/200 [01:48<03:46,  1.44s/it]
 22%|██▏       | 44/200 [01:54<07:02,  2.71s/it]
 23%|██▎       | 46/200 [01:57<05:37,  2.19s/it]
 24%|██▎       | 47/200 [01:59<05:31,  2.17s/it]
 24%|██▍       | 48/200 [02:02<05:43,  2.26s/it]
 25%|██▌       | 50/200 [02:03<03:33,  1.42s/it]
 26%|██▌       | 51/200 [02:03<03:02,  1.23s/it]
 26%|██▌       | 52/200 [02:04<02:53,  1.17s/it]
 26%|██▋       | 53/200 [02:08<04:21,  1.78s/it]
 28%|██▊       | 55/200 [02:10<03:30,  1.45s/it]
 28%|██▊       | 56/200 [02:15<05:32,  2.31s/it]
 28%|██▊       | 57/200 [02:16<04:57,  2.08s/it]
 29%|██▉       | 58/200 [02:17<04:23,  1.85s/it]
 30%|██▉       | 59/200 [02:24<07:31,  3.20s/it]
 30%|███       | 60/200 [02:27<07:15,  3.11s/it]
 31%|███       | 62/200 [02:28<04:27,  1.93s/it]
 32%|███▏      | 63/200 [02:29<03:41,  1.62s/it]
 32%|███▏      | 64/200 [02:34<05:36,  2.48s/it]
 32%|███▎      | 65/200 [02:35<04:49,  2.15s/it]
 33%|███▎      | 66/200 [02:35<03:43,  1.67s/it]
 34%|███▎      | 67/200 [02:36<03:26,  1.55s/it]
 34%|███▍      | 68/200 [02:37<02:50,  1.29s/it]
 34%|███▍      | 69/200 [02:39<03:27,  1.58s/it]
 35%|███▌      | 70/200 [02:40<02:39,  1.23s/it]
 36%|███▌      | 71/200 [02:42<03:12,  1.49s/it]
 36%|███▌      | 72/200 [02:47<05:46,  2.70s/it]
 36%|███▋      | 73/200 [02:48<04:39,  2.20s/it]
 37%|███▋      | 74/200 [02:49<03:35,  1.71s/it]
 38%|███▊      | 76/200 [02:50<02:12,  1.07s/it]
 38%|███▊      | 77/200 [02:51<02:34,  1.26s/it]
 40%|███▉      | 79/200 [02:55<03:03,  1.52s/it]
 41%|████      | 82/200 [02:56<01:53,  1.04it/s]
 42%|████▏     | 83/200 [02:58<02:17,  1.18s/it]
 42%|████▏     | 84/200 [02:59<01:57,  1.02s/it]
 42%|████▎     | 85/200 [03:01<02:23,  1.25s/it]
 43%|████▎     | 86/200 [03:04<03:27,  1.82s/it]
 44%|████▎     | 87/200 [03:05<02:43,  1.44s/it]
 44%|████▍     | 88/200 [03:07<03:07,  1.68s/it]
 45%|████▌     | 90/200 [03:08<02:12,  1.20s/it]
 46%|████▌     | 91/200 [03:15<04:24,  2.43s/it]
 46%|████▋     | 93/200 [03:16<02:58,  1.67s/it]
 47%|████▋     | 94/200 [03:16<02:30,  1.42s/it]
 48%|████▊     | 95/200 [03:17<02:07,  1.22s/it]
 48%|████▊     | 96/200 [03:19<02:38,  1.53s/it]
 48%|████▊     | 97/200 [03:20<02:05,  1.22s/it]
 49%|████▉     | 98/200 [03:20<01:40,  1.02it/s]
 50%|█████     | 100/200 [03:21<01:06,  1.50it/s]
 50%|█████     | 101/200 [03:23<01:57,  1.18s/it]
 51%|█████     | 102/200 [03:24<01:40,  1.02s/it]
 52%|█████▏    | 103/200 [03:26<02:09,  1.34s/it]
 52%|█████▏    | 104/200 [03:27<01:48,  1.13s/it]
 53%|█████▎    | 106/200 [03:29<01:49,  1.17s/it]
 54%|█████▎    | 107/200 [03:32<02:16,  1.47s/it]
 55%|█████▍    | 109/200 [03:33<01:52,  1.23s/it]
 55%|█████▌    | 110/200 [03:36<02:14,  1.50s/it]
 56%|█████▌    | 111/200 [03:39<02:45,  1.86s/it]
 56%|█████▌    | 112/200 [03:39<02:14,  1.53s/it]
 56%|█████▋    | 113/200 [03:41<02:17,  1.58s/it]
 57%|█████▋    | 114/200 [03:42<01:52,  1.30s/it]
 57%|█████▊    | 115/200 [03:43<02:03,  1.45s/it]
 58%|█████▊    | 116/200 [03:44<01:41,  1.20s/it]
 59%|█████▉    | 118/200 [03:45<01:04,  1.28it/s]
 60%|█████▉    | 119/200 [03:51<02:56,  2.18s/it]
 60%|██████    | 120/200 [03:52<02:33,  1.92s/it]
 60%|██████    | 121/200 [03:54<02:28,  1.88s/it]
 61%|██████    | 122/200 [04:01<04:23,  3.38s/it]
 62%|██████▏   | 123/200 [04:05<04:21,  3.39s/it]
 62%|██████▏   | 124/200 [04:11<05:13,  4.12s/it]
 62%|██████▎   | 125/200 [04:11<03:51,  3.08s/it]
 63%|██████▎   | 126/200 [04:12<02:53,  2.34s/it]
 64%|██████▎   | 127/200 [04:12<02:13,  1.83s/it]
 64%|██████▍   | 128/200 [04:14<02:09,  1.79s/it]
 64%|██████▍   | 129/200 [04:16<02:07,  1.80s/it]
 65%|██████▌   | 130/200 [04:17<01:40,  1.44s/it]
 66%|██████▌   | 131/200 [04:18<01:43,  1.50s/it]
 66%|██████▋   | 133/200 [04:21<01:40,  1.49s/it]
 67%|██████▋   | 134/200 [04:22<01:24,  1.28s/it]
 68%|██████▊   | 135/200 [04:22<01:10,  1.09s/it]
 68%|██████▊   | 136/200 [04:23<01:11,  1.11s/it]
 68%|██████▊   | 137/200 [04:33<03:39,  3.48s/it]
 69%|██████▉   | 138/200 [04:34<02:45,  2.67s/it]
 70%|██████▉   | 139/200 [04:36<02:39,  2.61s/it]
 70%|███████   | 140/200 [04:46<04:50,  4.84s/it]
 70%|███████   | 141/200 [04:52<04:56,  5.02s/it]
 71%|███████   | 142/200 [04:52<03:34,  3.71s/it]
 72%|███████▏  | 143/200 [04:57<03:47,  3.99s/it]
 72%|███████▏  | 144/200 [05:04<04:35,  4.92s/it]
 72%|███████▎  | 145/200 [05:07<04:00,  4.37s/it]
 73%|███████▎  | 146/200 [05:11<03:51,  4.29s/it]
 74%|███████▎  | 147/200 [05:18<04:25,  5.00s/it]
 74%|███████▍  | 148/200 [05:26<04:59,  5.75s/it]
 74%|███████▍  | 149/200 [05:28<04:01,  4.74s/it]
 75%|███████▌  | 150/200 [05:29<02:55,  3.50s/it]
 76%|███████▌  | 151/200 [05:30<02:24,  2.94s/it]
 76%|███████▌  | 152/200 [05:35<02:43,  3.41s/it]
 76%|███████▋  | 153/200 [05:38<02:34,  3.28s/it]
 77%|███████▋  | 154/200 [05:40<02:10,  2.85s/it]
 78%|███████▊  | 155/200 [05:43<02:16,  3.04s/it]
 78%|███████▊  | 156/200 [05:52<03:30,  4.77s/it]
 78%|███████▊  | 157/200 [05:55<03:09,  4.40s/it]
 80%|███████▉  | 159/200 [05:57<01:48,  2.64s/it]
 80%|████████  | 160/200 [06:01<02:04,  3.11s/it]
 80%|████████  | 161/200 [06:06<02:22,  3.64s/it]
 81%|████████  | 162/200 [06:15<03:13,  5.08s/it]
 82%|████████▏ | 163/200 [06:16<02:27,  3.99s/it]
 82%|████████▏ | 164/200 [06:20<02:17,  3.81s/it]
 82%|████████▎ | 165/200 [06:21<01:45,  3.02s/it]
 83%|████████▎ | 166/200 [06:23<01:30,  2.67s/it]
 84%|████████▎ | 167/200 [06:32<02:33,  4.66s/it]
 84%|████████▍ | 168/200 [06:33<01:50,  3.45s/it]
 84%|████████▍ | 169/200 [06:41<02:33,  4.95s/it]
 85%|████████▌ | 170/200 [06:42<01:49,  3.65s/it]
 86%|████████▌ | 171/200 [06:45<01:45,  3.63s/it]
 86%|████████▋ | 173/200 [06:49<01:18,  2.91s/it]
 87%|████████▋ | 174/200 [06:55<01:35,  3.67s/it]
 88%|████████▊ | 175/200 [06:57<01:19,  3.19s/it]
 88%|████████▊ | 176/200 [07:01<01:22,  3.46s/it]
 88%|████████▊ | 177/200 [07:04<01:15,  3.28s/it]
 89%|████████▉ | 178/200 [07:10<01:29,  4.08s/it]
 90%|████████▉ | 179/200 [07:22<02:10,  6.23s/it]
 90%|█████████ | 180/200 [07:25<01:48,  5.45s/it]
 90%|█████████ | 181/200 [07:30<01:38,  5.21s/it]
 91%|█████████ | 182/200 [07:33<01:22,  4.56s/it]
 92%|█████████▏| 183/200 [07:42<01:40,  5.94s/it]
 92%|█████████▏| 184/200 [07:43<01:09,  4.34s/it]
 92%|█████████▎| 185/200 [07:44<00:50,  3.37s/it]
 94%|█████████▎| 187/200 [07:48<00:34,  2.66s/it]
 94%|█████████▍| 188/200 [07:49<00:28,  2.37s/it]
 94%|█████████▍| 189/200 [08:03<00:58,  5.31s/it]
 95%|█████████▌| 190/200 [08:09<00:57,  5.71s/it]
 96%|█████████▌| 191/200 [08:11<00:40,  4.45s/it]
 96%|█████████▌| 192/200 [08:11<00:26,  3.36s/it]
 96%|█████████▋| 193/200 [08:19<00:32,  4.66s/it]
 97%|█████████▋| 194/200 [08:34<00:46,  7.77s/it]
 98%|█████████▊| 195/200 [08:49<00:49,  9.86s/it]
 98%|█████████▊| 196/200 [09:14<00:56, 14.23s/it]
 98%|█████████▊| 197/200 [09:25<00:40, 13.35s/it]
 99%|█████████▉| 198/200 [09:32<00:23, 11.57s/it]
100%|█████████▉| 199/200 [09:37<00:09,  9.60s/it]
100%|██████████| 200/200 [09:56<00:00, 12.21s/it]
100%|██████████| 200/200 [09:56<00:00,  2.98s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200
Failed requests:                         0
Request rate configured (RPS):           1.00
Benchmark duration (s):                  596.27
Total input tokens:                      43560
Total generated tokens:                  43955
Request throughput (req/s):              0.34
Output token throughput (tok/s):         73.72
Peak output token throughput (tok/s):    294.00
Peak concurrent requests:                104.00
Total token throughput (tok/s):          146.77
---------------Time to First Token----------------
Mean TTFT (ms):                          1726.76
Median TTFT (ms):                        1456.21
P99 TTFT (ms):                           3637.76
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          596.55
Median TPOT (ms):                        595.53
P99 TPOT (ms):                           793.58
---------------Inter-token Latency----------------
Mean ITL (ms):                           593.31
Median ITL (ms):                         586.90
P99 ITL (ms):                            1963.80
==================================================